# -*- coding: utf-8 -*-
# FILE='cc_calc/real/init_data.py'
from os import sys, path
sys.path.append(path.dirname(path.dirname(path.abspath(__file__))))


from ideal.constants import *


INIT_DATA = {
    ################################## ГТУ ####################################

    "piair": 0.1 * 10**6, # тиск навколишнього повітря, Па
    "PIk": 10, # ступінь підвищення тиску в компресорі
    "Tiair": 15 + KELVIN_CONST, # температура навколишнього повітря, K
    "T4gte": 600 + KELVIN_CONST, # температура за ГТ, К
    "phiiair": 30 / P_100, # відносна вологість навколишнього повітря
    "gsg": "AirMix", # суміш в робочому тілі ГТ
    "gs0": "AirMix", # суміш продуктів згоряння
    "gair": 0.02, # відносна витрата повітря, що відбираеться для тех. потреб ГТУ
    "sigmapb": 4.5 / P_100, # втрати тиску вихідних газів із КУ
    "sigmacc": 6 / P_100, # втрати тиску в кз
    "ETAoi_c": 88.2 / P_100, # вн. відносний ККД компресора
    "ETAoi_gt": 88.4 / P_100, # вн. відносний ККД ГТ
    "Giair": 1, # масова витрата вхідного повітря, кг/c
    "ETAm_gte": 99.9 / P_100, # механічний ККД ГТУ
    "ETAc_c": 99.7 / P_100, # коеф. використання теплоти камери згоряння
    "Ql_h": 50 * 10**6, # нижча теплота згорання палива, Дж/кг (49-51)
    "Tl_h": 15 + KELVIN_CONST, # температура визначення нижчої теплоти згорання палива, К
    "L0": 17.207, # теор. маса повітря, що необхідна для спалювання 1 кг палива, кгп/кгп

    ################################## ПТУ ####################################

    "Tb_out": 350 + KELVIN_CONST, # температура на виході із КУ в циклі, К
    "pb_out": 6 * 10**6, # тиск на виході з КУ в циклі, Па
    "deltaps": 0.25 * 10**6, # гідравлічний опір пароперегрівача КУ, Па
    "sigmapp": 1 / P_100, # втрати тиску між КУ та ПТ, %
    "p2spe": 3 * 10**3, # тиск в конденсаторі, Па
    "T2spe": 25 + KELVIN_CONST, # температура за паровою турбіною, К
    "ETAg_spe": 99.8 / P_100, # ККД електрогенератора ПТУ, %
    "ETAm_spe": 99.8 / P_100, # ККД мех. ПТУ, %
    "ETAb": 80 / P_100, # ККД КУ, %
}
